var thing_data = [
	{
		start : 1328,
		nian_start : '洪武元年',
		title : '朱元璋出生',
		info : ''
	},
	{
		start : 1351,
		nian_start : '至正十一年',
		title : '韩山童、刘福通起义',
		info : ''
	},
	{
		start : 1353,
		nian_start : '至正十三年',
		title : '张士诚起义',
		info : '早年贩卖私盐为业。元末发动盐徒起义，于1354年在高邮称诚王，建国号为周，建元天佑。1356年，建都平江'
	},
	{
		start : 1363,
		nian_start : '至正二十三年',
		title : '潘阳湖战役',
		info : '此次水战，从七月二十日开始到八月二十六日结束，前后历时37天，其时间之长、规模之大，投入兵力、舰只之多、战斗之激烈都是空前的。'
	},
	{
		start : 1366,
		nian_start : '至正二十六年',
		title : '消灭张士诚',
		info : '打败张士诚、方国珍，南方基本统一在朱元璋旗下'
	},
	{
		start : 1367,
		nian_start : '至正二十七年',
		title : '北伐开始',
		info : '十月，徐达、常遇春率大军二十五万，朝北方进发；第二年8月，明军进逼北京，元顺帝带领三宫后妃、皇太子等弃城而走，全部逃往蒙古大草原'
	},
	{
		start : 1368,
		nian_start : '洪武元年',
		// end : 1450,  // end可有可无，视情况而定，若不是该事件没有时间跨度，则可以省略
		title : '明朝建立',
		info : '以应天为南京,称皇帝,建立明朝,年号洪武.朱元璋就是明太祖.当年秋天,明军攻入大都.元朝在全国的统治结束'  // info可有可无，若事件过于简单，可省略
	},
	{
		start : 1372,
		nian_start : '洪武五年',
		title : '第二次北伐',
		info : '徐达的主力中路军大败，李文忠的东路军得失相当，仅冯胜的西路军获胜。第二次北征以失败告终'
	},
	{
		start : 1376,
		nian_start : '洪武九年',
		title : '空印案',
		info : '朱元璋严惩地方计吏预持空白官印账册至户部结算钱谷的大案，诛杀数百名官员，连坐被杀的人数以万计'
	},
	
	{
		start : 1380,
		nian_start : '洪武十三年',
		end : 1392,
		nian_end : '洪武二十五年',
		title : '胡惟庸案',
		info : '胡惟庸案发,株连三万余人;罢中书省,废丞相制度.改大都督府为五军都督府.罢御史台,废御史大夫'
	},
	{
		start : 1380,
		nian_start : '洪武十三年',
		title : '第三次北伐',
		info : '命西平侯沐英率其陕西明军进攻，侦察到北元脱火赤到达乃路（今内蒙古额集纳旗东南），急行军七昼夜，渡黄河，经宁夏翻贺兰山，距敌营50里，分兵四路，乘夜合围，明军俘敌虏南下'
	},
	{
		start : 1385,
		nian_start : '洪武十八年',
		title : '郭桓案',
		info : '户部侍郎郭桓等人，通同各直省的官吏作弊，盗卖官粮。后被揭发，以其涉案金额巨大，对经济领域影响深远而为世人瞩目。对此，明太祖将六部左右侍郎以下皆处死，各省官吏死于狱中达数万人以上'
	},
	{
		start : 1393,
		nian_start : '洪武二十六年',
		title : '蓝玉案',
		info : '族诛一公、十三侯、二伯，牵连被杀一万五千多人，念及蓝玉与自己是儿女亲家，朱元璋心一软，宽大处理：碎剐改成剥皮'
	},
	{
		start : 1399,  // 公历
		nian_start : '建文元年', // 皇帝年号计数
		end : 1402,
		nian_end : '建文四年',
		title : '靖难之役',
		info : ''
	}
];